{
    "title": "Cream of Chicken and Rice Soup",
    "recipeinfo": {
        "blurb": "An tasty way to use leftover chicken",
        "genre": "Soup",
        "author": "David Horton",
        "yield": "4 servings"
    },
    "ingredientlist": [
        {
            "quantity": "6",
            "unit": "oz.",
            "fooditem": "chicken scraps"
        },
        {
            "quantity": "2",
            "unit": "Tbsp.",
            "fooditem": "flour"
        },
        {
            "quantity": "2",
            "unit": "Tbsp.",
            "fooditem": "butter"
        },
        {
            "quantity": "2",
            "unit": "C.",
            "fooditem": "chicken broth"
        },
        {
            "quantity": "1/4",
            "unit": "C.",
            "fooditem": "rice"
        },
        {
            "quantity": "1/2",
            "unit": "tsp.",
            "fooditem": "parsley"
        },
        {
            "quantity": "1/4",
            "unit": "tsp.",
            "fooditem": "pepper"
        },
        {
            "fooditem": "salt",
            "#text": "to taste"
        },
        {
            "quantity": "2",
            "unit": "C.",
            "fooditem": "milk"
        }
    ],
    "preparation": {
        "text": [
            "Cut chicken into bite-sized pieces. Combine chicken and flour in a mixing bowl and stir until chicken is well coated. Melt butter in a",
            "over medium heat. Add chicken and any excess flour. Cook until mixture begins to brown, stiring often. Slowly stir in chicken broth and bring to a boil. Add rice, parsley, salt and pepper. Reduce heat to low. Cover and cook until rice is tender, stiring occasionally to prevent sticking. Just before serving add milk and warm through. Do not allow soup to boil after adding milk as it will cause the milk to curdle and ruin the smooth texture of the soup."
        ],
        "equipment": "3-quart saucepan"
    },
    "serving": "Serve as an appetizer or combine with a sandwich and salad for a meal.",
    "notes": "This soup can be partially made ahead of time and frozen for a quick meal later on. Follow the recipe to the point just before adding the milk. Measure the soup into freezer-safe containers and cool rapidly in an ice bath. When ready to eat, thaw the soup and continue the recipe by adding the milk and warming through."
}