{
    "title": "Gumbo",
    "recipeinfo": {
        "blurb": "Warm your tummy with a New Orleans favorite.",
        "author": "David Horton",
        "genre": "Soups and stews",
        "yield": "6 servings",
        "preptime": "1 1/2 hours"
    },
    "ingredientlist": [
        "1/4 C. peanut oil",
        "1/3 C. flour",
        "1 small onion, diced",
        "2 ribs of celery, chopped",
        "1 small green pepper, seeded and diced",
        "3 plum (roma) tomatoes, diced",
        "1/4 lb. okra, sliced",
        "1/2 lb. chicken, cut into bite-sized pieces",
        "1/2 lb. pork cutlet, cut into bite-sized pieces",
        "1/2 lb. wee shrimp, cleaned and de-veined",
        "4 C. chicken stock",
        "1/4 tsp. cayenne pepper",
        "1/4 tsp. white pepper",
        "1/4 tsp. black pepper",
        "pinch of parley",
        "pinch of sage leaves",
        "pinch of thyme leaves",
        "pinch of mustard powder",
        "1 whole bay leaf",
        "salt to taste",
        "3/4 C. parboiled (converted) rice",
        "1 1/2 C. water"
    ],
    "preparation": {
        "text": [
            "Create a roux by mixing oil and flour in a",
            "over medium heat. Stir often with a",
            "until the roux becomes the color of peanut butter. Add onion, celery and green pepper. Be very careful as the roux is very hot and tends to splatter when the veggies hit it. Trade the wisk for a",
            "and stir often. When the onion begins to turn translucent add tomatoes and okra. As tomatoes and okra soften add the chicken and pork. The mixture will be very thick at this point, so add a little chicken stock as needed to make stiring less of a chore. When the chicken and pork are slightly browned add the remaining chicken stock and bring to a boil. Stir in all of the spices, cover the pot and reduce heat to a simmer. If the shrimp is frozen add it now otherwise wait until ten minutes before serving. Salt acording to taste. Add the rice to boiling water in a",
            ", reduce heat to low and cook for 25 minutes or according to package directions."
        ],
        "equipment": [
            "3-quart saucepan",
            "wire whisk",
            "large spoon",
            "1-quart saucepan"
        ]
    },
    "serving": "Place a ladle full of gumbo in a bowl and top with a couple spoonfuls of rice. Garnish with parsley if you're into the whole presentation thing.",
    "notes": "When saving leftovers store the gumbo and rice separately at least until both are completely cooled, otherwise the rice will get mushy."
}